// Напишіть функцію sumInput() яка:

// Просить користувача ввести дані за допомогою prompt та зберігає їх в масив.
// Закінчує робити запити в користувача після того, як введено не числове значення, порожня строка або натиснуто “відмінити”.
// Підраховує та повертає суму елементів масиву.
// P.S. Нуль 0 це – валідне число, будь ласка, не зупиняйте функцію при введені 0.

'use strict';

function sumInput(){
    let arr = [];
    let sum = 0;

    for (let i = 0; ;i++){
        arr[i] = prompt('Введіть числове значення (якщо більше вводити не потрібно, натисніть "відмінити"');
        if(isNaN(arr[i]) || arr[i] == null || arr[i] == '' ){
            break;
        }
    }
    arr.pop();
    alert(arr);
    
    for (let i = 0; i < arr.length; i++){
        sum += +arr[i];
    }
    return sum;
}

alert(sumInput());