// Напишите условие if для проверки, что значение переменной age НЕ находится в диапазоне 14 и 90 включительно.
// Напишите два варианта: первый с использованием оператора НЕ !, второй – без этого оператора.
'use strict';

let age;
age = prompt('Скільки вам років?(введіть число менше 14 і більш 90, ну можна і всередині)', 0);
if(age < 14 || age > 90){
    alert('Ти малюк або пенсія');
}else{
    alert('Гад');
}

age = prompt('Введіть ще раз (введіть число менше 14 і більш 90, ну можна і всередині)', 0);
if(!(age >= 14 && age <= 90)){
    alert('Ти точно малюк або пенсія');
}else{
    alert('Точно гад');
}