// Напишите код, который будет спрашивать логин с помощью prompt.
// Если посетитель вводит «Админ», то prompt запрашивает пароль, если ничего не введено или нажата клавиша Esc – показать «Отменено», в противном случае отобразить «Я вас не знаю».
// Пароль проверять так:
// Если введён пароль «Я главный», то выводить «Здравствуйте!»,
// Иначе – «Неверный пароль»,
// При отмене – «Отменено».
'use strict';

let login;
login = prompt('Це хто?(можливо адмін?)', '');
if(login === 'адмін'){
    let password = +prompt('Треба пароль', '');
    if(password === 12345){
        alert('Добрий вечір!');
    }else if(password === '' || password === null){
        alert('Відміна');
    }else{
        alert('Балван? Не вірний пароль');
    }
}else if(login === '' || login === null){
    alert('Відміна');
}else{
    alert('Я тебе не знаю');
}